# CannotCopyFromProjectAndLink Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyFromProjectAndLink Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't Copy to Clipboard elements from the project and a link instance at the same time. Only elements from the project will be copied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyFromProjectAndLink { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyFromProjectAndLink As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyFromProjectAndLink {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace